In [75]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

- column 수정

In [76]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [70]:
df['언어'].replace({'Python' : '중국어'} , inplace=True)

In [32]:
df

     이름   주소   나이   점수    언어
번호
1번  한주혁  즈그집  500    0   중국어
2번  이길동  특별시   23   88  Java
3번  강길동   대구   30   98   C++
4번  홍길동   대전   20  100   NaN
5번  박길동  즈그집   21   60   NaN
6번  나길동  특별시   25   90     C

In [88]:
df['언어'] = df['언어'].str.lower()
df

     이름    주소                                                 나이   점수      언어
번호
1번  김길동  광주시시  번호\n1번    33\n2번    23\n3번    30\n4번    20\n5번...   76  python
2번  이길동  서울시시  번호\n1번    33\n2번    23\n3번    30\n4번    20\n5번...   88    java
3번  강길동  대구시시  번호\n1번    33\n2번    23\n3번    30\n4번    20\n5번...   98     c++
4번  홍길동  대전시시  번호\n1번    33\n2번    23\n3번    30\n4번    20\n5번...  100     NaN
5번  박길동  광주시시  번호\n1번    33\n2번    23\n3번    30\n4번    20\n5번...   60     NaN
6번  나길동  서울시시  번호\n1번    33\n2번    23\n3번    30\n4번    20\n5번...   90       c

In [86]:
df['나이'] = df['나이'].astype(str) + '세'
df

     이름    주소                                                 나이   점수      언어
번호
1번  김길동  광주시시  번호\n1번    33\n2번    23\n3번    30\n4번    20\n5번...   76  PYTHON
2번  이길동  서울시시  번호\n1번    33\n2번    23\n3번    30\n4번    20\n5번...   88    JAVA
3번  강길동  대구시시  번호\n1번    33\n2번    23\n3번    30\n4번    20\n5번...   98     C++
4번  홍길동  대전시시  번호\n1번    33\n2번    23\n3번    30\n4번    20\n5번...  100     NaN
5번  박길동  광주시시  번호\n1번    33\n2번    23\n3번    30\n4번    20\n5번...   60     NaN
6번  나길동  서울시시  번호\n1번    33\n2번    23\n3번    30\n4번    20\n5번...   90       C

In [89]:
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [91]:
df['나이'] = df['나이'].astype(str) + '끼'
df

     이름  주소    나이   점수      언어
번호
1번  김길동  광주  33세끼   76  Python
2번  이길동  서울  23세끼   88    Java
3번  강길동  대구  30세끼   98     C++
4번  홍길동  대전  20세끼  100     NaN
5번  박길동  광주  21세끼   60     NaN
6번  나길동  서울  25세끼   90       C

#### column 추가

In [93]:
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [94]:
df['총합'] = df['나이'] * df['점수']
df

     이름  주소  나이   점수      언어    총합
번호
1번  김길동  광주  33   76  Python  2508
2번  이길동  서울  23   88    Java  2024
3번  강길동  대구  30   98     C++  2940
4번  홍길동  대전  20  100     NaN  2000
5번  박길동  광주  21   60     NaN  1260
6번  나길동  서울  25   90       C  2250

In [100]:
df['결과'] = 'fail'

In [101]:
df

     이름  주소  나이   점수      언어    총합    결과
번호
1번  김길동  광주  33   76  Python  2508  fail
2번  이길동  서울  23   88    Java  2024  fail
3번  강길동  대구  30   98     C++  2940  fail
4번  홍길동  대전  20  100     NaN  2000  fail
5번  박길동  광주  21   60     NaN  1260  fail
6번  나길동  서울  25   90       C  2250  fail

In [102]:
df.loc[df['총합'] > 1000, '결과'] = '통과'
df

     이름  주소  나이   점수      언어    총합  결과
번호
1번  김길동  광주  33   76  Python  2508  통과
2번  이길동  서울  23   88    Java  2024  통과
3번  강길동  대구  30   98     C++  2940  통과
4번  홍길동  대전  20  100     NaN  2000  통과
5번  박길동  광주  21   60     NaN  1260  통과
6번  나길동  서울  25   90       C  2250  통과

#### column 삭제

In [103]:
df.drop(columns='총합')

     이름  주소  나이   점수      언어  결과
번호
1번  김길동  광주  33   76  Python  통과
2번  이길동  서울  23   88    Java  통과
3번  강길동  대구  30   98     C++  통과
4번  홍길동  대전  20  100     NaN  통과
5번  박길동  광주  21   60     NaN  통과
6번  나길동  서울  25   90       C  통과

In [104]:
df

     이름  주소  나이   점수      언어    총합  결과
번호
1번  김길동  광주  33   76  Python  2508  통과
2번  이길동  서울  23   88    Java  2024  통과
3번  강길동  대구  30   98     C++  2940  통과
4번  홍길동  대전  20  100     NaN  2000  통과
5번  박길동  광주  21   60     NaN  1260  통과
6번  나길동  서울  25   90       C  2250  통과

#### row 삭제

In [105]:
df.drop(index='4번', inplace=True)
df

     이름  주소  나이  점수      언어    총합  결과
번호
1번  김길동  광주  33  76  Python  2508  통과
2번  이길동  서울  23  88    Java  2024  통과
3번  강길동  대구  30  98     C++  2940  통과
5번  박길동  광주  21  60     NaN  1260  통과
6번  나길동  서울  25  90       C  2250  통과

In [106]:
df

     이름  주소  나이  점수      언어    총합  결과
번호
1번  김길동  광주  33  76  Python  2508  통과
2번  이길동  서울  23  88    Java  2024  통과
3번  강길동  대구  30  98     C++  2940  통과
5번  박길동  광주  21  60     NaN  1260  통과
6번  나길동  서울  25  90       C  2250  통과

In [108]:
cond = df['점수'] < 80
df[~cond]

     이름  주소  나이  점수    언어    총합  결과
번호
2번  이길동  서울  23  88  Java  2024  통과
3번  강길동  대구  30  98   C++  2940  통과
6번  나길동  서울  25  90     C  2250  통과

In [109]:
df[cond].index

Index(['1번', '5번'], dtype='object', name='번호')

In [20]:
df.drop(index=df[cond].index)

     이름   주소  나이   점수    언어    총합    결과
번호
2번  이길동  서울시  23   88  JAVA  2024  Fail
3번  강길동  대구시  30   98   C++  2940  Pass
4번  홍길동  대전시  20  100   NaN  2000  Fail
6번  나길동  서울시  25   90     C  2250  Pass